## Creating Data Frame

In [92]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

## Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [3]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [40]:
dict1=dict(df['FlightNumber'][df['FlightNumber'][df['FlightNumber'].isna()].index-1])

In [58]:
df1=df['FlightNumber'].shift(1)+10

In [62]:
df['FlightNumber']=df['FlightNumber'].fillna(df1[df1.notna()])
df['FlightNumber']=df['FlightNumber'].astype('int')

In [63]:
df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int64

In [64]:
df.dtypes

From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

## The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [93]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [96]:
fromtemp=[]
totemp=[]
for k in df['From_To'].str.split('_'):
  fromtemp.append(k[0])
  totemp.append(k[1])
df['From']=fromtemp
df['To']=totemp

In [98]:
df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    LoNDon      paris
1      MAdrid_miLAN           NaN  ...    MAdrid      miLAN
2  londON_StockhOlm       10065.0  ...    londON  StockhOlm
3    Budapest_PaRis           NaN  ...  Budapest      PaRis
4   Brussels_londOn       10085.0  ...  Brussels     londOn

[5 rows x 6 columns]

## Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [102]:
df['From']=df['From'].str.capitalize()
df['To']=df['To'].str.capitalize()

In [103]:
df.head()

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN           NaN  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis           NaN  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]

## 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [104]:
df=df.drop('From_To',axis=1)

In [105]:
df.head()

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

## In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays

In [110]:
for i in range(max([len(i) for i in df['RecentDelays']])):
  df['delay_'+str(i)]=np.nan

In [111]:
df.head()

   FlightNumber  RecentDelays              Airline  ... delay_0 delay_1  delay_2
0       10045.0      [23, 47]               KLM(!)  ...     NaN     NaN      NaN
1           NaN            []    <Air France> (12)  ...     NaN     NaN      NaN
2       10065.0  [24, 43, 87]  (British Airways. )  ...     NaN     NaN      NaN
3           NaN          [13]       12. Air France  ...     NaN     NaN      NaN
4       10085.0      [67, 32]          "Swiss Air"  ...     NaN     NaN      NaN

[5 rows x 8 columns]

In [143]:

for i in df['RecentDelays']:
  while(len(i)<3):
    i.append(np.nan)

In [152]:
k=0
for i  in (df['RecentDelays']):
  print(i)
  print(k)
  df['delay_0'][k]=i[0]
  df['delay_1'][k]=i[1]
  df['delay_2'][k]=i[2]
  k=k+1

[23, 47, nan]
0
[nan, nan, nan]
1
[24, 43, 87]
2
[13, nan, nan]
3
[67, 32, nan]
4

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [153]:
df.head()

   FlightNumber     RecentDelays  ... delay_1 delay_2
0       10045.0    [23, 47, nan]  ...    47.0     NaN
1           NaN  [nan, nan, nan]  ...     NaN     NaN
2       10065.0     [24, 43, 87]  ...    43.0    87.0
3           NaN   [13, nan, nan]  ...     NaN     NaN
4       10085.0    [67, 32, nan]  ...    32.0     NaN

[5 rows x 8 columns]

In [154]:
df.columns=['FlightNumber', 'RecentDelays', 'Airline', 'From', 'To', 'delay_0',
       'delay_1', 'delay_2']

In [155]:
df.head()

   FlightNumber     RecentDelays  ... delay_1 delay_2
0       10045.0    [23, 47, nan]  ...    47.0     NaN
1           NaN  [nan, nan, nan]  ...     NaN     NaN
2       10065.0     [24, 43, 87]  ...    43.0    87.0
3           NaN   [13, nan, nan]  ...     NaN     NaN
4       10085.0    [67, 32, nan]  ...    32.0     NaN

[5 rows x 8 columns]